var name01 = prompt ('Кто я?');
//var name02 = prompt ('А кто ты?');

alert (name01);

let div= document.createElement('div');
div.innerHTML = `Кто я?
<br>- ${name01}.
<br>- А кто ты?
<br>- ${name01}.
<br>- Ты тоже ${name01}?
<br>- Да. Я та, кого знают как ${name01}.
<br>- Мы все те, кого знают, как ${name01}.
<br>- Как они все могут быть мной?
<br>- Просто потому что другие зовут нас ${name01}. Только и всё. <br> У тебя ненастоящая душа, и тело твоё - подделка. Знаешь почему?
<br>- Я не подделка и не фальшивка. Я - это я.
<br>- Нет, ты всего лишь оболочка с поддельной душой, созданная человеком по имени Гендо Икари. <br> Ты всего лишь нечто, притворяющееся человеком. Вот, прислушайся к себе. Чувствуешь эту неуловимую, почти неразличимую сущность, скрытую в твоих самых мрачных снах? Именно это и есть ты.
<br>- Я - это я. Я стала собой благодаря связям и отношениям с другими людьми. <br> Меня создало общение с людьми. Они создают меня, я создаю их. Эти отношения и связи определяют чувства моей души и моего разума.
<br>「Это узы?」
<br>- Да. Это то, что связывает меня с создателем существа по имени ${name01}. <br> Это то, что всегда будет определять моё "я".
<br>「Это узы」
<br>- Однако есть ещё кое-что, обладающее твоим истинным "я". <br> Ты её не знаешь, ты не хочешь знать её и пытаешься скрыть эту сторону своей подлинной сущности.
<br>「Из-за страха」
<br>- Потому что может оказаться, что у неё не человеческий облик, <br> потому что твоя личность в этом случае может исчезнуть.
<br>「Это страх」
<br>- Превратиться в ничто - вот что пугает тебя. <br> Ты боишься исчезнуть из сознания других людей из-за существования ещё одной тебя.
<br>- Я боюсь? С чего вдруг?
<br>- Потому что твоя личность исчезнет.
<br>「Ты боишься, не так ли?」
<br>- Потому что перестанешь существовать.
<br>「Ты боишься, не так ли?」
<br>- Нет. Я счастлива. Именно этого я и хочу. Смерти, отчаяния. <br> Хочу уйти в небытие. <br> Но не могу. <br> Он пока не может разрешить мне уйти. <br> Он ещё не пускает меня. <br> Я живу, пока нужна ему. <br> Но когда всё кончится, я стану ненужной. <br> Он оставит меня. <br> Я мечтаю о дне, когда он меня покинет. <br> Но сейчас... я боюсь этого...`;
document.body.append(div);